import java.util.List;
import java.util.Arrays;
import java.util.HashMap;

public class Constants {
	
	public final static HashMap<String, List<String>> map = new HashMap<String, List<String>>() {{
		put("10_0", Arrays.asList("城轨珠海站","拱北口岸","拱北","华侨宾馆","摩尔广场","隧道南","柠溪","香宁花园","南香里","南坑","香洲总站","紫荆园","梅华东","华子石西","华子石东","中大五院","水拥坑海天公园","契爷岭","美丽湾","凤凰湾","银星花园","银坑","叠石","鸡山南","鸡山","中山大学","白埔路口","唐家","唐家市场","港湾一号","渔村","海怡湾畔","珍珠乐园","南方软件园","白沙、魅族","国际赛车场经济港","宝莱特科技","官塘","下栅","金鼎市场","高新区人民医院","金鼎","上栅","中珠桥","外沙","北山村","威士茂北门","河头埔","下栅检查站"));
		put("10_1", Arrays.asList("下栅检查站","河头埔","威士茂北门","北山村","外沙","中珠桥","上栅","金鼎","高新区人民医院","金鼎市场","下栅","官塘","宝莱特科技","国际赛车场经济港","白沙、魅族","南方软件园","珍珠乐园","海怡湾畔","渔村","港湾一号","唐家市场","唐家","白埔路口","中山大学","鸡山","鸡山南","叠石","银坑","银星花园","凤凰湾","美丽湾","契爷岭","水拥坑海天公园","中大五院","华子石东","华子石西","梅华东","紫荆园","香洲总站","南坑","南香里","香宁花园","柠溪","隧道南","摩尔广场","华侨宾馆","拱北","城轨珠海站"));
		put("11_0", Arrays.asList("香洲港","北堤","燃气集团","凤凰北","翠香中","夏美","光明街","胡湾里","警察学校","六小","柠溪市场","青竹花园","柠溪","隧道南","摩尔广场","华侨宾馆","拱北","国寿大厦","粤华西","嘉豪园","前河东路南","夏湾路口","拱北工商分局","夏湾"));
		put("11_1", Arrays.asList("夏湾","侨光小学","粤华西","国寿大厦","拱北口岸","拱北","华侨宾馆","摩尔广场","隧道南","柠溪","柠溪市场","六小","警察学校","胡湾里","光明街","夏美","香洲总站","紫荆园","为农市场","燃气集团","北堤","香洲港"));
		put("20_0", Arrays.asList("吉大总站","海滨南","信海大厦","园林西","吉大","九洲城","海滨公园","公积金中心","湾仔沙","人民医院","二中","滨海楼","南香里","香宁花园","柠溪","武警支队","卓雅花园","暨大北门","艺术高中","招商花园城","翠微市场","上冲","翠屏路","上冲总站"));
		put("20_1", Arrays.asList("上冲总站","翠屏路","上冲","恒隆学校","翠微市场","招商花园城","艺术高中","暨大北门","卓雅花园","武警支队","柠溪","香宁花园","南香里","滨海楼","二中","人民医院","湾仔沙","公积金中心","海滨公园","九洲城","中医院","信海大厦","海滨南","吉大总站"));
		put("32_0", Arrays.asList("城轨珠海站","拱北口岸","拱北","华侨宾馆","摩尔广场","隧道南","柠溪","香宁花园","南香里","南坑","香洲总站","紫荆园","梅华东","华子石西","华子石东","中大五院","水拥坑海天公园","契爷岭","神前总站"));
		put("32_1", Arrays.asList("神前总站","美丽湾","契爷岭","水拥坑海天公园","中大五院","华子石东","华子石西","梅华东","紫荆园","香洲总站","南坑","桃园新村","南香里","香宁花园","柠溪","隧道南","摩尔广场","华侨宾馆","拱北","城轨珠海站"));
		put("35_0", Arrays.asList("跨境工业区","中心路中","跨境工业区北","粤华西","第二人民医院","拱北","华侨宾馆","北岭","隧道南","武警支队","卓雅花园","暨大北门","艺术高中","招商花园城","翠花苑","红山修理厂","华翠豪庭","红山路南","行政服务中心","梅华中","珠海一中","特警支队","诚丰怡园","公安村","云顶澜山"));
		put("35_1", Arrays.asList("云顶澜山","公安村","诚丰怡园","特警支队","珠海一中","梅华中","行政服务中心","红山路南","华翠豪庭","红山修理厂","翠花苑","招商花园城","艺术高中","暨大北门","卓雅花园","武警支队","隧道南","北岭","华侨宾馆","拱北","国寿大厦","粤华西","港昌南","侨光西","跨境工业区北","中心路中","跨境工业区"));
		put("55_0", Arrays.asList("夏湾","权晖花园","港二路","海荣新村","城轨前山站","前山","世邦广场","暨南大学","暨大北门","卓雅花园","武警支队","柠溪","香宁花园","南香里","南坑","香洲总站","紫荆园","党校、市卫健局","大镜山","城市广场","山场路中","电视台北门","香山驿站","梅华中","珠海一中","蓝盾路口","恒雅名园","公交花园","城轨明珠站","翠屏路","上冲总站"));
		put("55_1", Arrays.asList("上冲总站","翠屏路","城轨明珠站","公交花园","恒雅名园","蓝盾路口","珠海一中","梅华中","香山驿站","市图书馆","电视台北门","山场路中","城市广场","大镜山","党校、市卫健局","紫荆园","香洲总站","南坑","桃园新村","南香里","香宁花园","柠溪","武警支队","卓雅花园","暨大北门","暨南大学","世邦广场","瀚林苑","前山","城轨前山站","海荣新村","港昌中","拱北工商分局","夏湾"));
		put("10A_0", Arrays.asList("拱北口岸总站","华侨宾馆","摩尔广场","隧道南","柠溪","香宁花园","南香里","南坑","香洲总站","紫荆园","梅华东","华子石东","中大五院","水拥坑海天公园","契爷岭","美丽湾","凤凰湾","银星花园","银坑","鸡山南","鸡山","中山大学","唐家","唐家市场","花果山","海怡湾畔南门","北师大附中","珍珠乐园","南方软件园","白沙、魅族","国际赛车场经济港","宝莱特科技","德豪润达","北理工","宁堂","北理工南门","京师家园","北师大","联合国际学院","北师大、","京师家园、","北理工南门、","宁堂、","城轨唐家湾站"));
		put("10A_1", Arrays.asList("城轨唐家湾站","德豪润达","宝莱特科技","国际赛车场经济港","白沙、魅族","南方软件园","珍珠乐园","北师大附中","海怡湾畔南门","花果山","唐家市场","唐家","中山大学","鸡山","鸡山南","银坑","银星花园","凤凰湾","美丽湾","契爷岭","水拥坑海天公园","中大五院","华子石东","梅华东","紫荆园","香洲总站","南坑","南香里","香宁花园","柠溪","隧道南","摩尔广场","华侨宾馆","拱北","拱北口岸总站"));
		put("201_0", Arrays.asList("香洲","南坑","南香里","香宁花园","柠溪","武警支队","卓雅花园","暨大北门","暨南大学","世邦广场","瀚林苑","前山","华发新城","北山、华发商都","南屏街口","南泉路口","南屏中学","公交柏宁","南屏水库","河排","珠光汽车公司","广生","公交信禾物流","翠湾","广昌","均昌、奔图科技","珠海大桥东","珠海大桥西","灯笼路口","鹤洲东","湖心路口","西湖城区","保利香槟","时代山湖海","二号闸","金湾高尔夫","青湾","新世界花园","遵义医学院","黄绿背","金海岸市场东","金都大厦","金海岸中学","金沙湾豪庭","斜尾","城建总公司","鱼弄","日东涂料","中南修理厂","月堂","唐人街","映月新村","三灶"));
		put("201_1", Arrays.asList("三灶","映月新村","唐人街","月堂","中南修理厂","日东涂料","鱼弄","城建总公司","斜尾","金沙湾豪庭","金海岸中学","金都大厦","金海岸市场东","黄绿背","遵义医学院","新世界花园","青湾","金湾高尔夫","二号闸","时代山湖海","保利香槟","西湖城区","湖心路口","鹤洲东","灯笼路口","珠海大桥西","珠海大桥东","均昌、奔图科技","广昌","翠湾","公交信禾物流","广生","珠光汽车公司","河排","南屏水库","公交柏宁","南屏中学","南泉路口","南屏街口","北山、华发商都","华发新城","前山","世邦广场","暨南大学","暨大北门","卓雅花园","武警支队","柠溪","香宁花园","南香里","南坑","香洲"));
		put("K1_0", Arrays.asList("城轨珠海北站","罗西尼","官塘","南方软件园","海怡湾畔","唐家市场","唐家","中山大学","中大五院","香洲总站","南坑","香宁花园","柠溪","隧道南","摩尔广场","华侨宾馆","拱北","拱北口岸总站"));
		put("K1_1", Arrays.asList("拱北口岸总站","华侨宾馆","摩尔广场","隧道南","柠溪","香宁花园","南坑","香洲总站","中大五院","中山大学","唐家","唐家市场","海怡湾畔","南方软件园","官塘","罗西尼","城轨珠海北站"));

	}};
	
	
}
